Repository: Azonaz/GreekWordsA2
Catalog: *.lproj/Localizable.strings
Languages: ru

source: Quiz
ru: Квиз

# quizRandomSelection
source: Random quiz
ru: Случайный квиз

# quizGroups
source: Quiz by groups
ru: Квиз по группам

source: Check verbs
ru: Проверка глаголов

source: Verbs
ru: Глаголы

source: Next verb
ru: Следущий глагол

source: Total verbs
ru: Всего глаголов

# seenVerbs
source: Verbs seen
ru: Просмотрено глаголов

# wordDay
source: Word of the day
ru: Слово дня

source: Training
ru: Тренировка

# categories
source: Choose a group
ru: Выберите группу

source: Settings
ru: Настройки

source: Language
ru: Язык

# blurOn
source: Show answers on tap
ru: Показывать ответы по тапу

# blurOff
source: Answers visible
ru: Ответы видны

source: Restart
ru: Начать заново

source: Back
ru: Назад

source: Result
ru: Результат

source: Statistics
ru: Статистика

# allWords
source: Total words
ru: Всего слов

source: Quizzes completed
ru: Пройдено квизов

source: Words seen
ru: Просмотрено слов

source: Average percentage
ru: Средний процент

source: Information
ru: Информация

# quizInfo
source: Quiz Mode
ru: Режим квиза

# quizHelp
source: The Quiz section lets you test your knowledge of Greek words in an interactive way. Each round has 10 questions. You can choose a game mode: • By groups — words are grouped by topics, and the counter next to each group shows how many words you have already seen and the total number of words in that group; • Random — words are selected from the entire vocabulary without being tied to specific topics. In the Settings section, you can select your preferred language or enable blur mode to hide answers until you tap the screen. You can see your quiz statistics and progress in the Statistics section.
ru: В разделе «Квиз» вы можете проверять свои знания греческих слов в игровом формате. Каждый раунд состоит из 10 вопросов. Вы можете выбрать режим игры: • по группам — слова сгруппированы по темам, а счётчик рядом с названием группы показывает количество уже увиденных слов и их общее количество в этой группе; • случайный — слова выбираются из всего словаря без привязки к темам. В разделе «Настройки» можно выбрать предпочтительный язык или включить режим размытия, чтобы скрыть ответы до тех пор, пока вы не коснетесь экрана. Статистику сыгранных квизов и общий прогресс можно посмотреть в разделе «Статистика».

# trainingInfo
source: Training Mode
ru: Режим тренировки

# trainingHelp
source: The Training section helps you reinforce Greek vocabulary using a spaced-repetition system inspired by Anki. Once you open a topic in the Quiz section, all its words automatically become available for training. You can review flashcards at your own pace, while the app selects the optimal moment to repeat each word. Each flashcard screen offers four rating options: • Again — you couldn’t recall the word; the next review is scheduled sooner. • Hard — the word is recalled with effort; the interval increases only slightly. • Good — the word is remembered confidently. • Easy — the word is well mastered; the interval increases noticeably more. The algorithm analyzes your answers and determines the best time to show each word again, helping you store it in long-term memory. Try the Training mode free for one week. After the trial, full access can be unlocked with a one-time purchase.
ru: Раздел «Тренировка» помогает закреплять греческие слова с помощью системы интервального повторения, вдохновлённой принципами Anki. После открытия темы в разделе «Квиз» её слова автоматически становятся доступны для тренировки. Вы можете проходить карточки в удобном темпе, а приложение выбирает оптимальный момент для повторения каждого слова. На экране каждой карточки доступны четыре оценки: • Снова — слово не вспомнилось; повторение назначается раньше. • Трудно — слово даётся с усилием; интервал увеличивается минимально. • Хорошо — слово вспоминается уверенно. • Легко — слово усвоено отлично; интервал увеличивается заметно сильнее. Алгоритм анализирует ваши ответы и сам определяет, когда показать слово снова, чтобы закрепить его в долговременной памяти. Попробуйте режим «Тренировка» бесплатно в течение недели. После окончания пробного периода полный доступ можно получить с помощью единовременной покупки.

source: Show translation
ru: Показать перевод

# wordsDone
source: All the words for today are done!
ru: Все слова за сегодня пройдены!

# noOpenGroups
source: You don't have any open groups yet. To open a group, complete at least one topic in the Quiz section.
ru: У вас пока нет открытых групп. Чтобы открыть группу, пройдите хотя бы одну тему в разделе Квиз.

# wordsToday
source: Words for today:
ru: Слов на сегодня:

source: New:
ru: Новые:

source: Learning:
ru: Изучение:

source: Review:
ru: Ревью:

# rating.again
source: Again
ru: Снова

# rating.hard
source: Hard
ru: Трудно

# rating.good
source: Good
ru: Хорошо

# rating.easy
source: Easy
ru: Легко

# wordsLearn
source: Words in progress
ru: Слова в изучении

source: Words learned
ru: Выучено слов

# weakWords
source: Words you struggle with
ru: Слова, которые вам не даются

# wWords
source: Challenging words
ru: Слова, которые не даются

# staleWords
source: Words you haven’t reviewed in a while
ru: Слова, которые давно не повторяли

source: Study words
ru: Учить слова

source: Review words
ru: Повторить слова

# done
source: All the words are done!
ru: Все слова пройдены!

source: Words left:
ru: Осталось слов:

# newWordsNumber
source: New words per day
ru: Новых слов в день

source: Training access
ru: Доступ к тренировкам

# accessExpired
source: Training access expired
ru: Доступ к тренировкам истёк

# unlockAccess
source: Your free trial week has ended. Unlock unlimited access to Training with a one-time purchase.
ru: Ваша пробная бесплатная неделя закончилась. Разблокируйте полный доступ к тренировкам единовременной оплатой.

# errorPurchase
source: Purchase failed. Please try again.
ru: Покупка не удалась. Пожалуйста, попробуйте ещё раз.

source: Unlock for
ru: Разблокировать за

# loadPrice
source: Loading price…
ru: Подождите, загружается цена…

# restore
source: Restore purchase
ru: Восстановить покупку

source: Purchase restored
ru: Покупка восстановлена

# noPurchase
source: No purchases to restore
ru: Нет покупок для восстановления

# rateApp
source: Rate the app
ru: Оценить приложение

source: Reverse quiz
ru: Обратный квиз

# reverseQuizInfo
source: Reverse Quiz Mode
ru: Режим обратного квиза

# reverseQuizHelp
source: The Reverse Quiz follows the same rules as the regular mode, but in reverse: you are shown a word in your native language and choose its correct translation into Greek.
ru: В «Обратном квизе» используются те же правила, что и в обычном режиме, но наоборот: вам показывается слово на родном языке, вы выбираете его правильный перевод на греческий.

# present
source: shows what is happening now, what happens often, or what is always true. It is like Simple Present in English.
ru: показывает то, что происходит сейчас, происходит регулярно или является общим фактом. Настоящее время в русском языке.

# future
source: shows something that will happen once in the future and be finished. It's like Simple Future in English.
ru: показывает действие, которое произойдёт один раз в будущем и будет завершено. Будущее время в русском языке.

# past
source: shows something that happened once in the past and is finished. It doesn't say when or how long. It's like Simple Past in English.
ru: показывает действие, которое произошло один раз в прошлом и уже завершено. Не указывается, когда именно или как долго длилось. Прошедшее время в русском языке.

# wordDayStreak
source: Streak
ru: Дни подряд

# wordDayCompleted
source: Days completed
ru: Пройденные дни

source: Levels
ru: Уровни

source: Other levels
ru: Другие уровни

# a1
source: Want to refresh your basic vocabulary?
ru: Хотите освежить базовую лексику?

# a2
source: Current level
ru: Текущий уровень

# b1
source: The next step in learning
ru: Следующий шаг в обучении

# here
source: You're here
ru: Вы здесь

# verbInfo
source: Verb Mode
ru: Режим глаголов

# verbHelp
source: In the “Verbs” section, you see a verb in the selected language and three hidden cards with the Greek verb in the present, future, and past tenses. Cards are revealed when tapped, allowing you to check the correct answer.
ru: В разделе «Глаголы» вы видите глагол на выбранном языке и три скрытые карточки с греческим глаголом в настоящем, будущем и прошедшем времени. Карточки открываются по нажатию, позволяя проверить правильность ответа.

# wordDayHelp
source: In the “Word of the Day” section, the letters are scrambled, and your task is to arrange them to form the hidden Greek word. A hint is available to help you.
ru: В разделе «Слово дня» буквы перемешаны, и ваша задача — собрать из них загаданное слово на греческом. Для помощи можно использовать подсказку.
